app/views/recipes/show.html.haml

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 8]]
---
        %ul
          - @recipe.ingredients.each do |ingredient|

SELECT "directions".* FROM "directions" WHERE "directions"."recipe_id" = $1  [["recipe_id", 10]]
---
        %ul
          - @recipe.directions.each do |direction|