app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"  ORDER BY created_at DESC
---
  def index
    @recipe = Recipe.all.order("created_at DESC")

INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Chicken"], ["description", "AaAaAaAaAaAaAaAa"], ["created_at", "2015-06-29 20:27:46.837440"], ["updated_at", "2015-06-29 20:27:46.837440"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save

UPDATE "recipes" SET "image_file_size" = $1, "image_updated_at" = $2, "image_file_name" = $3, "updated_at" = $4 WHERE "recipes"."id" = $5  [["image_file_size", 177868], ["image_updated_at", "2015-06-30 02:57:16.073942"], ["image_file_name", "fajitas.jpg"], ["updated_at", "2015-06-30 02:57:16.198279"], ["id", 7]]
---
  def update
    if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 3]]
---
  def destroy
    @recipe.destroy

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 3]]
---
  def find_recipe
    @recipe = Recipe.find(params[:id])